Smoking Pipe Tutorial/smoking_pipe_transient/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    Inlet
    {
        type            patch;
        nFaces          1767;
        startFace       409433;
    }
    Outlet
    {
        type            patch;
        nFaces          3102;
        startFace       411200;
    }
    PipeHandle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4683;
        startFace       414302;
    }
    Walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19564;
        startFace       418985;
    }
)

// ************************************************************************* //
